/**
 *
 * TermsAndConditions
 *
 */

import React from 'react';
import PropTypes from 'prop-types';
import { connect } from 'react-redux';
import { withStyles } from '@material-ui/core/styles';
import { Helmet } from 'react-helmet';
import { createStructuredSelector } from 'reselect';
import { compose } from 'redux';
import injectSaga from 'utils/injectSaga';
import injectReducer from 'utils/injectReducer';
import { Link } from 'react-router-dom';
import selectTermsAndConditionsDomain from './selectors';
import reducer from './reducer';
import saga from './saga';
import styles from './styles';

/* eslint-disable react/prefer-stateless-function */
export class TermsAndConditions extends React.PureComponent {
  render() {
    const { classes } = this.props;
    return (
      <>
        <Helmet>
          <title>Terms and Conditions</title>
          <meta name="description" content="Description of TermsAndConditions" />
        </Helmet>
        <section>
          <div className={classes.topBox}>
            <div className={classes.breadCrumbsBox}>
              <Link to="/" className={classes.breadCrumbsLink}>
                Главная
              </Link>
              <span> / </span>
              <span style={{ fontWeight: 700 }}>Условия использования</span>
            </div>
            <h2 className={classes.title}>ЗАГАЛЬНІ УМОВИ КОРИСТУВАННЯ</h2>
            <p>(по формальному официальному договору - оферти )</p>
          </div>
          <div className={classes.container}>
            <p>(ФОП Харін Захар Олександрович), платник податку к приборам предприятий на загальних підставах, надалі за текст - «Сайт», «Орендар сайту», «beautylinks.com», керуючись законодательного законодательства Украины, публічно умное зоотехническое законодательство. послугами сервісу, особам, які перей отправили на сайт и просмотр Колективный контент без створення облікового запису, Учасникам, «beautylinks.com», які разом іменуються «Сторони», а окремо - «Сторона» укласти, шляхом акцептування наступающего договір:</p>
            <h3>1. Загальні положення</h3>
            <p>1.1. Цей Договірладається шляхом над укання повної й безумовної згоди (акцепту) Учасника на укладення Договору в повному обсязі, без підпису письмового примірника Договору Сторонами.</p>
            <p>1.2. Договір має юридичну силу відповідно до ст.ст. 633, 641, 642 Цивильный кодексу України і івносильним Договору, подписаному Сторонами.</p>
            <p>1.3. Учасник підтверджує факт ознайомлення и згоди з усіма умовами цього Договору в повному обсязі шляхом акцептування.</p>
            <p>1.4. Будь-яка с наступающих дій вважається акцептом цього договора публічної оферти:</p>
            <p>- факт реєстрації Учасника на Веб-сайті «beautylinks.com» и оформление використанции відповідно до умов и порядков данного Договора, на веб-сайтеі Виконавця beautylinks.com</p>
            <p>- оплата послуг Незалежного специалиста на умовах и в порядках, визначеними этих Договоров и на відповідних сторінках Веб-сайту Виконавця beautylinks.com;</p>
            <p>- письмове (в т. Ч в електронній формі засобами електронної пошти) повідомлення Учасника про прийняття умов цього Договору на адрес електронної пошти, зазначену на сайтеі «beautylinks.com»</p>
            <p>1.5. Укладаючи цей Договір Учасник автоматично погоджується с повниманием и безумовним прийняттям положен цього Договора, цін на Послуги и все додатків, які є невід'ємними частинами Договора.</p>
            <p>1.6. Якщо Учасник не згодний з умовами Договору, він не має права укладати цей Договір, а також не вправі користуватися Послугами за цим Договором.</p>
            <h3>2. Визначення термінів</h3>
            <p>Сторони домовилися, по терміни, які зустрічаються у цьому Договорі, вживаються у наступающего значенні:</p>
            <p>1) «Клієнт» означа Учасника, який бронює и оплачиваемый Професійні послуги незалежного спеціаліста за допомогою сайту «beautylinks.com».</p>
            <p>2) «Колективний контент» означа Контент учасників та вільний контент.</p>
            <p>3) «Зміст» означал текст, графіку, изображения, музику, программу забезпечення, аудіо, відео, інформацію інформацію или інші матеріали.</p>
            <p>4) «Вільний контент» означающий весь Вміст, який бесплатный доступ к Сайту или Служб, включаючи будь-який Вміст, ліцензов третьей стороною, але виключаючи Вміст учасників.</p>
            <p>5) «Профіль незалежного спеціаліста» означа описать спеціаліста и детальную информацию о його методи, доступність и ціни, показаноі наі.</p>
            <p>6) «Професійні послуги» - це послуги, які надаються незалежной практикойчими.</p>
            <p>7) «Незалежний спеціаліст« та «спеціаліст» означа Учасника, який створює профіль незалежного спеціаліста через.</p>
            <p>8) «Учасник» означал особу, яка завершила рестрації облікового запису, включаючи, але не обмежуючись незалежними спеціалістами и клієнтами.</p>
            <p>9) «Контент учасника« означающий весь Вміст, який учасник публіку, загрузку, подає, передає или включающий у себя профіль незалежних спецістів или профіль учасника, який повин бути доступный наі Сайт.</p>
            <p>10) «Податок» или «Податки» означают будь-які податки за продажу, податки на додану вартість (ПДВ), податки на товари та послуги</p>
            <p>11) «Підсумок бронювання» - это реквізити плати за професиональные посылки и профессиональные посылки, які були заброньовані и оплаченный Клієнтом. Копія якої надсилається Клієнту та незалежному спеціалісту електронною поштою, а також визуа наться на вкладці «Бронювання“ в користувальницькій області користувача.</p>
            <p>12) «Винагорода для професійні послуги» - це суми, які належать и сплачуються Клієнтом в обмін на Професійні послуги незалежного спеціаліста.</p>
            <p>13) «Плата за обслуживание» означивает плату, яку стягує Сайт незалежного спецаліста для використанции Послуги, яка обчислюється у відповідної винагороди за професійні послуги.</p>
            <h3>2. Визначення термінів</h3>
            <p>Сторони домовилися, по терміни, які зустрічаються у цьому Договорі, вживаються у наступающего значенні:</p>
            <p>1) «Клієнт» означа Учасника, який бронює и оплачиваемый Професійні послуги незалежного спеціаліста за допомогою сайту «beautylinks.com».</p>
            <p>2) «Колективний контент» означа Контент учасників та вільний контент.</p>
            <p>3) «Зміст» означал текст, графіку, изображения, музику, программу забезпечення, аудіо, відео, інформацію інформацію или інші матеріали.</p>
            <p>4) «Вільний контент» означающий весь Вміст, який бесплатный доступ к Сайту или Служб, включаючи будь-який Вміст, ліцензов третьей стороною, але виключаючи Вміст учасників.</p>
            <p>5) «Профіль незалежного спеціаліста» означа описать спеціаліста и детальную информацию о його методи, доступність и ціни, показаноі наі.</p>
            <p>6) «Професійні послуги» - це послуги, які надаються незалежной практикойчими.</p>
            <p>7) «Незалежний спеціаліст« та «спеціаліст» означа Учасника, який створює профіль незалежного спеціаліста через.</p>
            <p>8) «Учасник» означал особу, яка завершила рестрації облікового запису, включаючи, але не обмежуючись незалежними спеціалістами и клієнтами.</p>
            <p>9) «Контент учасника« означающий весь Вміст, який учасник публіку, загрузку, подає, передає или включающий у себя профіль незалежних спецістів или профіль учасника, який повин бути доступный наі Сайт.</p>
            <p>10) «Податок» или «Податки» означают будь-які податки за продажу, податки на додану вартість (ПДВ), податки на товари та послуги</p>
            <p>11) «Підсумок бронювання» - это реквізити плати за професиональные посылки и профессиональные посылки, які були заброньовані и оплаченный Клієнтом. Копія якої надсилається Клієнту та незалежному спеціалісту електронною поштою, а також визуа наться на вкладці «Бронювання“ в користувальницькій області користувача.</p>
            <p>12) «Винагорода для професійні послуги» - це суми, які належать и сплачуються Клієнтом в обмін на Професійні послуги незалежного спеціаліста.</p>
            <p>13) «Плата за обслуживание» означивает плату, яку стягує Сайт незалежного спецаліста для використанции Послуги, яка обчислюється у відповідної винагороди за професійні послуги.</p>
            <h3>3. Предмет договору</h3>
            <p>3.1 «beautylinks.com» предоставляет услуги онлайн-платформ («Послуги»), яка з'єднує незалежних спеціалістів, включаючи, але не обмежуючись; косметологи, масажисты и стилісти для волосся с клієнтами, які шукають их професійні послуги. Службы доступа к веб-сайтам [beautylinks.com] и любым другим веб-сайтам, через свои собственные послуги власник сайту.</p>
            <p>3.2 Використовуючи Сайт, ви погоджуєтесь дотримуватися и бути юридично связанными умовами цього Договора, Договору, незалежно від того, чи стали ви зареєстрованим користувачем Послуг. Цей Договор регулирует ваш доступ к сайту и всьему колективному контенту и созданию юридичну угоду між вами та «beautylinks.com».</p>
            <p>3.3 Сайт хранится на онлайн-платформах, чтобы дополнительные якої незалежные спецслужбы могли создавать профили и продавать свои професиональные посылки, а также позволять осуществлять доступ к независимым спецслужбам и замораживать их. В розумієте та погоджутесь, що Сайт не є стороною сельскохозяйственных угодий, укладених між незалежными спеціалістами и клієнтами. Сайт не контролює поведение незалежных спецістів, клієнтів и інших користувачів Сайту та Служба, чтобы выявляться відповідальності с цього приводу в максимально допустимом законодательстве обсязі.</p>
            <p>3.4 Сайт оплаты услуг по обслуживанию незалежных спецслужб, які при Договдналися к данному Договору на умовах и в порядку, визначених відповідними пунктами данного Договора.</p>
            <p>3.5 «beautylinks.com» та ФОП Харін З.О. за собою право, на власний розсуд, змінювати Сайт или за собою договор, включает плату за обслуживание, в любой момент и без попереднього повідомлення.</p>
            <p>3.6. У випадку зміни умов даного Договора, «beautylinks.com» публіку оценки договір на Сайті или іншим на заседании чином повідомля учасників про зміну умов даного Договора.</p>
            <p>3.7. Продам доступ или доступ к версии Сайта того, что можно сделать версію Договора було опубликовано на сайте или обеспечение условий международного умственного труда, во вказультате, для того, чтобы ви погоджусьте бути повязки договориться.</p>
            <p>3.8. Сайт призначений виключно для осіб віком від 18 років. Будь-який доступ или використанция Сайту особами, які не досягли 18 років, прямо заборонено. Доступ к веб-сайту или доступ к ним ви представляют как гаранту, що вам виповнилося 18 років.</p>
            <h3>4. Рестрація облікового запису</h3>
            <p>4.1 Для того, чтобы предоставить доступ к певческим функцій Сайту и забронировать професійні послуги или створити профіль, особа повинна зареєструватися, щоб створити обліковий записать и стати Учасником.</p>
            <p>4.2. Подробная информация и страница профиля на сайте «beautylinks.com» позволяет получить нужную информацию, которую можно найти в режиме рестрації.</p>
            <p>4.3. Шляхом реєстрації Учасник погоджується надавати точну, поточну и повну інформацію під час реєстрації та оновлювати таку інформацію, щоб вона була точною, актуальною и повною.</p>
            <p>4.4. «Beautylinks.com» заслушивает собою право призупинити или закритичные сообщения записать учасника и доступ к сайту, якщо будь-яка інформація, надана Учасником в процесі реєації або після цього, виявиться неточною, шаховрайюкою, не обязательно, шаховрайюкою.</p>
            <p>4.4. Учасник несе відповідальність за захист свого пароля доступу к обліковому запису. Учасник погоджується, що не буде розголошувати свій пароль будь-якій третій стороні і бере на себе повну відповідальність за будь-які дії виконані з використання обліиниковую запись Учасника на сайте в «beautylinks.com», незалежно .</p>
            <p>4.5.Учасник зобов'язаний негайно повідомити «beautylinks.com» про будь-яке несанкціоноване використання облікового запису.</p>
            <h3>5.Профіль незалежного спеціаліста.</h3>
            <p>5.1 Учасник може створити профіль незалежного спеціаліста с метою продажу послуг незалежного практикуючого спеціаліста через Сайт.</p>
            <p>5.2 Створюючи профіль незалежного спеціаліста Учасник погоджується із розміром, умовами и порядком сплати плати за обслуговування.</p>
            <p>5.3. Під часа створенний профіль незалежный спеціаліста, особі, яка бажає створити такий профіля будуть задані різноманітні питання, включаючи, аля не обмежуючьтесь питаннями щодо місая надання такая послуг, детальної інформаций про пропоновані професійні послугу, професійний досвід роботи, кваліфікаций та наявність професійних послуги і ціноутворенни. «Beautylinks.com» предоставил собою право составить специальную редакцию профилей незалежного специалиста за результаты анализа материалов на его основе.</p>
            <p>5.4. Профілі незалежних спеціалістів оприлюднюються на Сайті. Клієнти зможть забронировать професійні послуги на Сайті на основі інформації, наданої у профілі незалежного спеціаліста. Незалежные спеціалісти розуміють и погоджуються, чтобы після того, как Клієнт здійснить бронювання професиональные посылки відповідного незалежного спеціаліста, такий спец.</p>
            <p>5.5.Незалежные спеціалісти несуть відповідальність для свій профіль незалежного практикуючого спеціаліста та контент учасника, який опублікований відповідному профілі.</p>
            <p>5.6. Незалежный спецназ гарант, професиональные послуги, детально описані у профілі незалежного спецістіста, надаються відповідно до вимогу чинного законодательства Украины.</p>
            <p>5.7 «beautylinks.com» не несе відповідальності за дотримання незалежним спеціалістом будь-яких домов или обов'язків перед третьими сторонами, чинного законодавства, правил, тощо. «Beautylinks.com» предоставляет право в любое время и без нового вида или отключение доступа к любому профилю незалежного специалиста из любой страны.</p>
            <p>5.8 Незважаючи на вищезазначене, «beautylinks.com» виконує функції обмеженого уповноваженого агента збору платежа незалежного спеціаліста с метою прийняття від імені незалежного спеціаліста платежів від клімнтів.</p>
            <p>5.9 Незалежный спеціст шляхом по созданию профилей незалежного спеціста погоджується, как «beautylinks.com» с правом на переднего мені укладати из Клієнтами попередній договір надання ним професійних послуг, незаліліх профілілій. Водночас, незалежний спеціаліст не має право составить від передання послуг за таким договором, на які здійснено підтверджене броню, за винятком форс-мажорних обставин или за інших до поважних причин, відавповідно.</p>
            <h3>6. Верифікація та обмеження вимог</h3>
            <p>6.1 «beautylinks.com» не підтверджує повноваження, компетенцію чи професійні навички жодного Учасника. Даним договором передбачено обов'язок учасників надавати точну інформацію, і хоча «beautylinks.com» может быть здійснюват додаткові перевірки с метою підтвердження чи перевірки особи чи компетенції Учасникодівірки »</p>
            <p>6.2. Будь-які посилання на Сайті на «перевіреного» или «верифікованого» (или подібні терміни) Учасника вказую лише на те, для учасник пройшов відповідний процес перевірки, відповідно до умов даного Договора. Будь-який подібний опис не є, сертифікацією чи гарантією від «beautylinks.com» щодо будь-якого учасника, включаючи особу Учасника та те, чи є учасник надійним, безпечним чи підходящим. Натомість будь-який подбираемый описатель значений для того, чтобы использовать коричною для Клієнта оцінкою при установленном главном рішенье особи и дополнительные осіб, с якими Клітнт контактує или в эту услугу, Сайт.</p>
            <p>6.3. Використовая Сайт, Учасники и другие особи погоджуються, чтобы быть любым правовым засіб захисту или відповідальність, яку Учасники прагнет покласти за дії чи бездіяльність іншів в этой іній іній іній іній інічій іншій іній іній ініцій інітрівній інкітрівній інтрівній інтрікії, інтрівніе інтрібнів ініт інтрікій, інтрікій інтрібнів ітрібнів, інтр. Ви погоджутесь не намагатися покладить відповідальність или вимагати-якого правового захисту стосовно таких дій чи бездіяльности від «beautylinks.com». Это обмеження не расширяется на претензию незалежного специалиста до «beautylinks.com» та орендаря сайту ФОП Харін З.О. щодо переказу платежів, отриманих от «beautylinks.com» Клієнта від імені незалежного спеціаліста.</p>
            <h3>7. Загальні умови бронювання и фінансові умови для незалежних спецістів и клієнтів</h3>
            <p>7.1.Якщо Клієнт бронює професійні послуги Учасника через Веб-сайт, незалежный спеціаліст надсилається наступна інформаций: імая то прізвище Клієнта, який здійснив бронювання, підсумок бронювання професійняя послуги які оплачується Клієнт, місец, дата та час, коли відповідні професійні послуга мають бути надані, номер по телефону Клієнта.</p>
            <p>7.2 «beautylinks.com» опубликовал статью «Отправить сейчас» (Отправить - рассылать оплату на Сайт) и нажать кнопку «Отправить сейчас».</p>
            <p>7.3. Винагорода для профессиональных услуг, оплаченного Клієнтом перерахованіться відповідному незалежному спец. а такожные податки и подборки, в том числе, почти не виключно ПДВ протягом за 48 лет с моментом передачи відповідних профессиональных послуг Клієнту (за винятком випадків. Може залежать в методу виплат, образует незалежный спеціалів. Дэйкі методы передбачають використанцию   сторонніх процесорів,</p>
            <p>7.4. Кожен незалежний спеціаліст признает «beautylinks.com» в особі орендаря сайту ФОП Харін З.О., як обмеженого агента збору винагороди за професійні послуги, сплаченої Клієнтами, які отримали такі послуги зикориням;</p>
            <p>7.5. Кожна незалежний спеціаліст погоджується з тим, що оплата, здійснен Клієнт, вважатиметься такой, що була здійснена безпосередий незалежный спеціаліст, і незалежний спеціаліст надає професійні послуги, доступні Клієнта в узгодженьем спосібе, як якщо б незалежний спеціаліста отримав плату за професійні послугу у іншего спосіба. Кожен незалежний спеціаліст погоджується, по «beautylinks.com» может, відповідно до політики дозировать клинту, чтобы добавить броню и повернуть Клівнту частину винагороди для профессиональных послуг. Кожен незалежний спеціаліст розуміє, що оскільки «beautylinks.com» приймає платежі від Клієнтів як обмежений агент збору платежів від Клієнтів, тот же «beautylinks.com» не проверяет буферизованные вина, якобы не спілівіні спец.</p>
            <p>7.6. Сайт «beautylinks.com» является агентом незалежных спецслужб с отриманением винагороди для професиональных услуг, «beautylinks.com» не является независимым агентством по вопросам бездействия спецслужб.</p>
            <p>7.7 Незалежные спецподразделения не предоставляют возможности для виконання будь-яких підтверджених броню и надання будь-яких профессиональных посылок, зарезервованих через Сайт.</p>
            <p>7.8 Якщо Клієнт уклада угоду из Незалежных спеціалістом шляхом бронювання професійних послуг, Клієнт погоджується такими розумі, чтобы угода укладаться безпосередньо профильно з Незалежнім спеціалістом в правилах, посылать информацию о правилах передачи, таинственного обнуления. Клієнт визнає та погоджується, самостийно несе відповідальність для виконання зобов'язань за какие-либо сторонние угодья, що «beautylinks.com» не є Договою сторонних угодий, быть, за винятком своїхних зобов'язань, перед .com »выявляется в зависимости от того, какие угодья вам нравятся, и от того, что вам нужно. Клієнт визнає та погоджується, що, незважаючи на те, що «beautylinks.com» не є стороною угоди між вами та незалежним спеціалістом, «beautylinks. com »виступа агентом збору платежів незалежного практичного зобмеженного метою прийому платежів від вас від імені незалежного спеціаліста. Після оплата винагороди за профессиональные послуги, ваша платная помощь незалежному описанию припиняється, і «beautylinks.com» несе відповідальні Договоры за перерахование винных компаний за профессиональные послуги (за спорыігікоміком). У випадку, якщо «beautylinks.com» не перерахувало відповідну винагороду, відповідний незалежний спецістіст звертається из виключно в «beautylinks.com», а не до Клієнта. com »несе відповідальність для перерахувания винагороди за профессиональные послуги (за винятком комісійних послуг) в спосіб, описание в Цьому Договорі. У випадку, якщо «beautylinks.com» не перерахувало відповідну винагороду, відповідний незалежний спеціаліст звертається из виключно в «beautylinks.com», а не до Клієнта. com »несе відповідальність по перерахованию винагороди за профессиональные послуги (за винятком комісійних послуг) в спосіб, описании в Цьому Договорі. У випадку, якщо «beautylinks.com» не перерахувало відповідну винагороду, відповідний незалежний спецістіст звертається из виключно в «beautylinks.com», а не до Клієнта.</p>
            <p>7.9. «Beautylinks.com» не может контролировать работу компьютеров, которые можно использовать с клиентами, чтобы помочь клиентам «beautylinks.com» винагороди для профессиональных посылок, и «beautylinks.com ФО. . відмовляються від будь-якої відповідальності з цього приводу.</p>
            <p>7.10. Під час бронювання Клієнту пропонуться перед этим звичайну платіжну інформацію, так як ім'я, платіжна адрес и дані кредитної карты, или «beautylinks.com» и орендарю сайта, или сторонньому процесору платежів. Клієнт погоджутеся оплатить будь-які підтверджені броню, зробленые в зв'язке с отобранными броню відповідно до данного Договора, одним способом, описанием на Сайт. через LiqPay или кредитну карту. Клієнт надає дозировка для стягивания суми відповідної винагороди за профессиональные описания винагороди, даны данные банковской картины, переданной части броню, без передачи или онлайн или онлайн-оплаты, или через одну опосредованную оплату. Якщо вас направляет до сторонніх процесорів платежів «beautylinks.com», может дотримуватися положень та умов, для регуляции послуги третьих сторон, а так же практики збору особистої інформації третьи сторони. Перегляньте такі умови и умения приватности, перш ніж користуватися послугами. Після завершения вашей підтвердженої операції бронювання в отримажте електронний лист с підтвердженням, за підсумовує підтверджене бронювання.</p>
            <h3>8. Скасування и повернення коштів</h3>
            <p>8.1 Якщо Клієнт, скасовує бронювання, здійснене через Веб-сайт до или після того, як професійні послуги були надані, до такой прокладки будуть застосовані умови уідповідного профістістістії відповідного.</p>
            <p>8.2. У випадку проверки незалежного специального оборудования, работающего на сайтах, «beautylinks.com», відшкодов за профессиональную посылку для такового броню відповідному клінту протягиванию 24-летнего электронного электронного оборудования и отладчика электронного оборудования.</p>
            <p>8.3. У випадка скасуваннь незалежний спеціаліст підтвердженый бронювання, «beautylinks.com» може застосовуватите штрафні санкції до такого незалежного спеціаліст або профіля незалежного спеціаліста, включаючи публікаций у профілі незалежный спеціаліст інформації про скасування підтвердженый бронювання, строковый або~d безстроковый блокуваннь профіль відповідного спеціаліст, утриманнь суй поверненый « beautylinks.com »винагороди за професійні послуги (утримується с майбутніх виплат).</p>
            <p>8.4. Штрафні санкції не застосуються, якщо незалежний спецістіст доведе, так что скасування було здійснено з поважних причин, зокрема настання форс-мажорних обставин, инших причин, які можнти бути визначені «я поважі причин. Незалежный спецістіст може публиковать информацию о «beautylinks.com» и документи по підтвердження поважності причин скасувания.</p>
            <h3>9. Помилки обробки платежів.</h3>
            <p>9.1 «beautylinks.com» предоставляет усіх заходов для исправления каких-либо помилок обробки платежів, когда які стало відомо. Такі заходи можуть включить в себе зарахувание чи списання (для необязательности) платежу відповідно с возможностью, який використовуться для почтовой виплати чи платежу.</p>
            <h3>10. Податки</h3>
            <p>10.1 Незалежні спеціалісти, погоджуються для несуть повідповідальність за своєчасну и повну сплату податків, подання податкової звітності, виконання инших вимог чинного законодавства у податковій сфері.</p>
            <h3>11. Поведінка користувача</h3>
            <p>11.1. Учасники и особи, які перейдят на сайт и просматривают колективный контент без детективного анализа информации и погоджуються, чтобы не проверять проверочные законы, правила, правила, положительные и податливые аналитические исследования.</p>
            <h3>12. Конфіденційність</h3>
            <p>12.1 Сторони домовилися, независимо от материалов, информации и информации, из стали відомі в процесів виконання зобов'язань за цимором Договора є конфиденційними і не могли передать третейскую судебную палату, судебные протоколы.</p>
            <p>12.2. Стороны зобовязуються не распространять информацию по договору, чтобы сообщить данные о финансовых материалах и информации о кожно-сырьевых материалах, участие в розыгрыше может быть инициировано до спричивания репутации збит / с.</p>
            <p>12.3. Представитель погоджується самостийно и в любом случае для обеспечения приватности доступа к техническим устройствам.</p>
            <p>12.4. Протяг 3 (трьох) роки з момента припинення дії цього Договору Стороните зобов'язується не розголошувати надану інформацію, у тому числі інформацая про фінансову діяльність, комерційні умови, методи обслуговування будь-якой іншого особі, підприємству, організації та установі тот не використовувати зазначену інформацію для власних корисливих цілей.</p>
            <p>12.5. Сторонники зобов'язуться на членском форуме по приватизации, чтобы не допустить розголожения или использования этой информации, будь-якою международной организацией, организацией, учреждением тазаці.</p>
            <p>12.6. Інформація, отримана с использованием визначених в Договорі засобів комунікації є приватіденційною и повинна використоватись із дотриманням умов приватіденційності. Передача інформації третім особого суворо забороняється и може бути розцінена як порушення умов співпраці за даним Договором.</p>
            <h3>13. Повідомлення про права власності</h3>
            <p>13.1 Сторони визнають, сайт и колективный контент, включающий все пов'язания с ним права інтелектуальной власности, виключною власністю «beautylinks.com» и її ліцензіарів. Учасники зобов'язуються видаляти, змінювати или затіняти быть-які повідомлення по авторским правам, торговым маркам, службам марке и інші повідомлення про права власності, що містяться на Сайті чи Колективному Контенті.</p>
            <p>13.2. Всі торговые марки, знаки обслуживания, логотипы, торговое обслуживание и будь-то які инші фірмові познание «beautylinks.com» які використовуються на Сайті торговими марками или зареставрированными торговыми марками «BeautyLinks OU». Будь-які инші торговые марки, знаки обслуживания, логотипы, торгові назви и будь-які иностранные фірмові позначения є торговими марками или зарестрованими торговыми позначенями їх відповідних власников.</p>
            <h3>14. Призупинение, припинение и внутреннее скоснение рахунку.</h3>
            <p>14.1. «Beautylinks.com» залицо за собою право на властвующий розсуд и без відповідальності перед іншими сторонами, с причиною или без приводу, за промежуточное обеспечение или без цього, как в любом случае, предварительное рассмотрение, деформацию процесса обмена запису Учасника.</p>
            <h3>15. Відповідальність сторін</h3>
            <p>15.1. У випадку невиконання или неналежного виконання зобов'язань за даним Договором Сторона несе відповідальність у відповідності положена цього Договора и чинного законодательства Украины.</p>
            <p>15.2. Порушенням Договору є його невиконання или неналежне виконання, тобто виконання з порушенням умов, визначених змістом ць Договора.</p>
            <h3>16. Захист персональних даних</h3>
            <p>16.1. Сторони розуміють и погоджуються с этим, по персональным данным, в розуміні Закону Украины «Про охрану личных дел», які стали відомі одній Стороной від іншої укрів від стороны відсідепів відвідепарти, стороны в рамках и / или виконання процігінії, » обробля (в том числе передає іншій Стороні за Договором) так и відповідності до вимог чинного законодавства україни у сфері захисту персональних даних.</p>
            <p>16.2. При этом факте (подпись и направление заяви на приднання) Договор свідчить про згоду Сторін на передання одна однотипная сторона отрицается при укладке и / или виконанні Договора необязательна, а также виконанні Договор необязательна, для реалізації прав и виконання обов'язків, передбачених Договором.</p>
            <p>16.3. Стороны домовилися, участвующие в разі порушення однією із Сторін персонін гарантій, передбачених Договоральній, в результате чого для іншої Стороны настали негативні наслідки (майнові и / чи немайнові претензіктіх іх, в том числе, округа, округа, округа, округа и т.д.), винна Сторона поддерживает претензию самостоятно в соответствии с предыдущей версией, и в этом документе содержится соответствующая информация в соответствии с договором, который позволяет компенсировать ее во всех исходных документах, опубликованных в документе. Стороною.</p>
            <p>16.4. Стороны зобовъязуються дотримуватировать приватизацию персональной стали, якіїм стали відомі в зв'язку з реалізацією положеницього Договора, и забезпечувать их арестованных відної обробки и задержать их незаконное изъятие відідід. 24 Закона Украины «О захист персональных даних» от 01.06.2010 р. № 2297-VI</p>
            <p>16.5. Якщо Представитель для целого виконання целого Договора буде володіти, оброблять или передавать данные які-небудь персональные данные суб'авних на персональные машины (клієнтів) Агент необязательно на постачальникам послуг, які виконують бронюнівнівани, то Представление Агенту или постачальникам послуг та дотримання законодавства про захист персональних даних.</p>
            <p>16.6. Представитель несе відповідальність о повідомлення суб' персонктів личных даних (клієнтів) и ознайомлення правами, визначеними ст. 8 Закон України «Про захист персональних даних».</p>
            <p>16.7. «Beautylinks OU» розробля и опубликовать на сайтеі beautylinks.com «политика захисту приватної інформації» яка є обов'язковою для ознайомлення для усіх Учасників.</p>
            <h3>17.Форс - мажорні обставини</h3>
            <p>17.1. Сторони звільняються відповідальності за невиконання или неналежное виконання зобов'язань, за передбачені данимором у випадком настання форс-мажорних обставин. Під форс-мажорными инструкциями по данному Договору раскрывается будь-які обставини, чтобы виникли поза волею или всевозможные воли чи бажанню Сторін и яких не могли передавать, блокировать, создавать, включать, землетрясения, завещания, передачи, сообщения, сообщения а такожное положение, которое приписывает органам государственной власти и управления роботами, резидентом якої є Замовник, или державы, резидентом якої є Виконавець, в свою очередь, передвигая якорные вставки (или одну из сторон, передающих передвижные части), доработки якобы изменяемых материалов или часть договора Договора, а также подробные сведения о подопечных, чтобы узнать поза волею Сторін.</p>
            <p>17.2. Якщо форс-мажорні обставини триватимуть більше 3-х (трьох) місяців поспіль, то кожна із Сторін матиме право составления від подальшого виконання зобов'язаній для этой партии Соглашения по составлению соглашения по такому разногласию .</p>
            <h3>18. Інші умови</h3>
            <p>18.1. Кожна Сторона гарантує іншій Стороні, що володі необхідною дієздатністю, и всю страну правами і повноваженнями, необхідними і достатками для укладання и виконання цього Договора відповідно до.</p>
            <p>18.2. Одностороння зміна умов укладеного Договору Замовником чи відмова виконувати умови укладеного Договора Замовником є   неприпустимою, за винятків випадків, передбачених цим Договора. Жодна зі Сторін цього Договора не передаются свои права и обязательства третейских сторон без права собственности друг на друга.</p>
            <p>18.3. ФОП Харін Захар Олександрович підтверджу, що є платником єдиного податку (група 3) за ставкою, передбаченою Податковим кодексом України.</p>
            <p>18.4. Сторони підтверджують, щося переписка, яка виконується за допомого вказаних підє рестрації Учасником засобів є офіційною, і має юридичну силу для сторін даного Договора</p>
          </div>
        </section>
      </>
    );
  }
}

TermsAndConditions.propTypes = {
  classes: PropTypes.object,
};

const mapStateToProps = createStructuredSelector({
  aboutUs: selectTermsAndConditionsDomain(),
});

function mapDispatchToProps(dispatch) {
  return {
    dispatch,
  };
}

const withConnect = connect(
  mapStateToProps,
  mapDispatchToProps,
);

const withReducer = injectReducer({ key: 'aboutUs', reducer });
const withSaga = injectSaga({ key: 'aboutUs', saga });

const TermsAndConditionsStyled = withStyles(styles)(TermsAndConditions);

export default compose(
  withReducer,
  withSaga,
  withConnect,
)(TermsAndConditionsStyled);
