/**
 *
 * PrivacyPolicy
 *
 */

import React from 'react';
import PropTypes from 'prop-types';
import { connect } from 'react-redux';
import { withStyles } from '@material-ui/core/styles';
import { Helmet } from 'react-helmet';
import { createStructuredSelector } from 'reselect';
import { compose } from 'redux';
import injectSaga from 'utils/injectSaga';
import injectReducer from 'utils/injectReducer';
import { Link } from 'react-router-dom';
import makeSelectPrivacyPolicy from './selectors';
import reducer from './reducer';
import saga from './saga';
import styles from './styles';

/* eslint-disable react/prefer-stateless-function */
export class PrivacyPolicy extends React.PureComponent {
  render() {
    const { classes } = this.props;
    return (
      <>
        <Helmet>
          <title>Privacy Policy</title>
          <meta name="description" content="Description of PrivacyPolicy" />
        </Helmet>
        <section>
          <div className={classes.topBox}>
            <div className={classes.breadCrumbsBox}>
              <Link to="/" className={classes.breadCrumbsLink}>
                Главная
              </Link>
              <span> / </span>
              <span style={{ fontWeight: 700 }}>Политика конфиденциальности</span>
            </div>
            <h2 className={classes.title}>Политика конфиденциальности</h2>
          </div>
          <div className={classes.container}>
            <p>Паюнова Ирина, [24.10.20 12:02]</p>
            <p>Главная / Политика конфиденциальности</p>
            <p>ПОЛІТИКА ЗАХИСТУ ПРИВАТНОЇ ІНФОРМАЦІЇ</p>
            <h3>1. Загальні положення</h3>
            <p>Дана Политика разработана и затверджена «BeautyLinks OÜ» и работает с индивидуальными настройками, настраивается и настраивается на другие сайты beautylinks.com</p>
            <p>Дана Политика використов термін «персональные данные» в розуміні Общего регламента по защите данных (ЕС) 2016/679 (GDPR).</p>
            <p>Дана Политика разработана с помощью метода формулировки коридоров про использование новых персональных данных «BeautyLinks OÜ» и методы их защиты в несанкціонованого доступа.</p>
            <p>Данная политика разработана в соответствии с нашей оценкой воздействия на защиту данных и внутренним положением о выборе персональных данных. Вы можете отправить документы по электронной почте по адресу support@beautylinks.com.</p>
            <h3>2. Інформація, яку ми миро збирати</h3>
            <p>Ми збираємо виключно інформацію, способ ввода під час реєстрації и здійснюю оплату професійних послуг відповідно по публічному договору. До неї належить:</p>
            <p>- Повне ім'я</p>
            <p>- Стать</p>
            <p>- Адреса електронної пошти</p>
            <p>- Адреса проживання</p>
            <p>- Номер телефона</p>
            <p>- Реквізити платіжної картки</p>
            <p>- Банківська інформація (номер рахунку, ідентифікатор банківської установи, тощо)</p>
            <p>- Інформація щодо послуживания за допомогою нашого сайту</p>
            <p>- Файлы cookie (открытые до правил использования файлы cookie, доступные для отправки тут )</p>
            <p>- Інформація, яку Ви надаєте в час спілкування із нами</p>
            <p>- Ваш IP - адрес</p>
            <h3>3. Правовое підґрунтя отримання такої інформації</h3>
            <p>Ми збираємо виключно інформацію, яка необхідна для здійснення діяльності сайту beautylinks.com и виключно ту, яка надана особами, які користуються сервісами цього сайту. Ми збираємо таку інформацію виключно у наступающих випадках:</p>
            <p>1) Ви погодилися на нас її (відповідно до загальних умений использовать сайт які доступні для посиланням тут )</p>
            <p>2) Коли нам необязательно отриматировать ваші данные для виконати умов договору</p>
            <p>3) Коли это необхидно для виконання вашего запиту про передання информации и у подібних випадках;</p>
            <p>4) У випадках, коли Законом нас зобов'язано таку інформацію збирати, наприклад на запит правоохоронних органів, але не виключно.</p>
            <p>Якщо у Вас виникли запитан стосовно правового підґрунтя використанням нашей інформації, переліченной в розділі 1, Ви можете звернутися до нас (указать способ обращения), і з вами зв'яжеться наш відповідальніої заїбїбї.</p>
            <h3>4. Використання інформації</h3>
            <p>Ми використовуємо інформацію, значение у розділі 1, виключно якщо на те є правова підстава. Ми не використовуємо таку інформацію у цілях прямого маркетингу .</p>
            <p>Зазвичай ми використовуємо таку інформацію у наступающих цілях:</p>
            <p>• Для адміністрування Веб-сайту beautylinks.com, включающего адміністрування вашего облікового запису у нас;</p>
            <p>• предоставить вам информацию о посылках или специальных предложениях, чтобы можно было узнать о них;</p>
            <p>• для статистических опитувальных цілей для покращения послуг веб-сайту;</p>
            <p>• чтобы они могли обрабатывать ваши сообщения и сообщения, пропущенные через Веб-сайт, який ви запитуте.</p>
            <p>• Для аудиту загрузки данных с Веб-сайту;</p>
            <p>• С метою покращения макету та / или способ просмотра веб-сайту та налаштування їх для користувачів;</p>
            <p>• З метою здійснення заходів щодо запобігання шахрайству;</p>
            <p>Якщо у вас виникли питання стосовно использует такої інформації Ви можете звернутися до нас (указать способи обращения), і с вами зв'яжеться наш відповідальній для восстановления такої інформації.</p>
            <h3>5. Обробка платежів</h3>
            <p>Надані вами платіжні реквізити будуть зашифровані за допомогою технології (указати технологію_). В этом случае необходимо указать вимогам GDPR с высокой степенью защиты и высоким уровнем защиты.) До их передачи через Интернет.</p>
            <p>В данном случае необходимо четкое понимание того, как работает технология шифровки. Это используется другое использование этого другого оператора / контролера данных (в этом другом варианте).</p>
            <h3>6. Обмін інформацією</h3>
            <p>Мы можем предоставить сукупную статистику відвіду посетителей Веб-сайту, клінтов и продаж с метою описанием наших послуг потенциційним партнерам, спонсоров и других общественных авторитетных сторонних экспертов по статистике.</p>
            <p>Паюнова Ирина, [24.10.20 12:02]</p>
            <p>Мы можем предоставить вам информацию о вашей компании, будь то информация о наших клиентах, или нашим агентам или підрядникам, я могу передать нам информацию через веб-сайт, отладить информацию, анонсировать, анонсировать и запрограммировать данные на веб-сайте. постоянно надаючи служби підтримки чи інші завдання. Наши агенты и группы анализируют вашу информацию в тій мірі, яка необхідна для виконання їх функцій.</p>
            <p>Якщо ми реорганізумось или продает третейский сторонний, ви погоджутесь, сторонний эксперт інформація, яку ми маємо про вас, может быть бути передана цій реорганізованій особі чии третій стороні, але виключно на підинадідставахого стороннего соглашения, але виключно на підставідставахого стороннего договора. Ми такожно ділитися будь-якою особистою інформацією, яку ми маємо про вас, середина наших груп компаній.</p>
            <p>Кроме того, вы можете получить информацию о любом регуляторе в соответствии с законодательством страны, опубликовать информацию о вашей компании и сообщить информацию о ней. Ми такожно предоставлять информацию о вашей особой информации, о том, как это сделать, для запоминания шахрайстов и киберзлочинностей, а также для захвата Веб-сайту или прав, владелец этой особой безкипеции. Водночас, запишите відповідних органів, подані без содержания вимог відповідного законодавства не можуть бути підставою для передачи такої інформації .</p>
            <h3>7. Зовнішні посилання</h3>
            <p>Час від часу веб-сайт може написать посылку на зовнішні веб-сайти. Ми не несемо відповідальності за политику приватности или внутри таких сайтов.</p>
            <h3>8. Безпека</h3>
            <p>Ми надаємо велике значення безпецсі всієї особистої інформації, пов'язаної з нашими користувачами. У захода безпеки для спроби защиты от ошибок, неправильного использования и зміни особистої информации, чтобы знать, что под нашим контролем. Наприклад, нашу політику безпеки и приватность періодично просматривать и вдосконалюють за необхідності, і лише уповноважений персонала має доступ к особистої інформації. Хоча ми не могут забезопасить или гарантировать, что втрата, неправильное включение или информация о никах не найдена, ми використово всех розумні зусилля для своей записи.</p>
            <p>Ви повинні мати на увазі, що подання інформації через Інтернет ніколи не є цілком безпечним. Якщо нам надається конфіденційна фінансова інформація, ми використовумо програмне забезпечення для шифрування, чтобы произвести запобігти отриманню несанкціонованого доступа к цієї інформації. Крім зазначених вище, ми не маємо доступу к та не зберігаємо приватности інформацію про засоби платежу; Тільки LiqPay., Наши постачальники платных услуг, предоставляют доступ к ції інформації, і до неї не могут отримати жодна третя сторона.</p>
            <p>Я не могу гарантировать бесплатную передачу информации через Веб-сайт, чтобы вона перебувалась через Интернет, а также передавала информацию на ваш владелец ризик.</p>
            <p>Доступно веб-просмотр, чтобы открыть веб-браузер, чтобы переконфигурировать его, чтобы он не открывал доступ к вашей информации, якщо в компьютерном компаунде.</p>
            <h3>9. Зберігання вашейої інформації</h3>
            <p>Інформація, яку ви надсилаєте через Веб-сайт, надсилаться и зберігається на защищених серверах. Это необхідно для того, чтобы получить информацию. Інформація, подана вами, может быть передана нами до інших наших офісів та / або третіх осіб, згаданих в вищеописаних обставлений (див. Обмін інформацією), яка може знаходит за межами Європейтовое вропейское вропейское вропейское простое управление ЄЕП. Зацікавлені країни можуть не мати аналогичных законів про захист даних, як ЄЕП. Там, де ми передамо вашу інформацію, ми вживемо все розумних заходов, чтобы обезпечить захист ваших прав на приватность. Подаючи інформацію через Веб-сайт, в погодных условиях, обробку и / или передачу.</p>
            <h3>10. Ваши права</h3>
            <p>- Наполягаємо на то, что является абсолютным беззаперечне право на наступление (в контексті даного положення):</p>
            <p> На отримання інформації інформації ідставізбиранні інформації переліченої в розділі 2;</p>
            <p>- На отримання нформації щодо шляхів використання інформації переліченої у розділі 2;</p>
            <p>Паюнова Ирина, [24.10.20 12:02]</p>
            <p>- На отримання нформації технічних и організаційних шляхів захисту інформації переліченої у розділі 2, як застосовуються;</p>
            <p>- На отримання інформації щодо, яку саме інформацію стосовно Вас ми маємо;</p>
            <p>- На отримання інформації стосовно того, у яких процесах и як саме використовуться інформація стосовно Вас;</p>
            <p>- На отримання копії (у будь-я кому зручному вигляді) усієї інформації стосовно Вас, яку ми маємо;</p>
            <p>- На заборной установке нашей информации о вас у будь - яких або деяких з процесів;</p>
            <p>- На видалення інформації стосовно вас (также известное как право на забуття)</p>
            <p>У будь - я кому випадку, ми всебічно и у повному обсязі гарантуємо нашу підтримку у реалізації Ваших законных прав щодо персональних даних, які ми збираємо.</p>
            <p>Этот гарант, чтобы ответить на ваш запрос, запишите будуть переданій по найкоротші строки та ви отримажте зворотній зв'язок щодо виконання Ваших законных вимог.</p>
            <h3>11. Контакти</h3>
            <p>Підтримка:</p>
            <p>support@beautylinks.com</p>
            <p>Співробітництво:</p>
            <p>sales@beautylinks.com</p>
            <p>Зв'язатися з адміністратором:</p>
            <p>admin@beautylinks.com</p>
            <p>Социальное:</p>
            <p>Facebook</p>
            <p>Instagramm</p>
          </div>
        </section>
      </>
    );
  }
}

PrivacyPolicy.propTypes = {
  classes: PropTypes.object,
};

const mapStateToProps = createStructuredSelector({
  aboutUs: makeSelectPrivacyPolicy(),
});

function mapDispatchToProps(dispatch) {
  return {
    dispatch,
  };
}

const withConnect = connect(
  mapStateToProps,
  mapDispatchToProps,
);

const withReducer = injectReducer({ key: 'aboutUs', reducer });
const withSaga = injectSaga({ key: 'aboutUs', saga });

const PrivacyPolicyStyled = withStyles(styles)(PrivacyPolicy);

export default compose(
  withReducer,
  withSaga,
  withConnect,
)(PrivacyPolicyStyled);
